[{"id": 1, "author": "Scott Adams ", "quote": "Engineers like to solve problems. If there are no problems handily available, they will create their own problems."}, {"id": 2, "author": "Antoine de Saint-Exupery", "quote": "Perfection is achieved, not when there is nothing more to add, but when there is nothing left to take away."}, {"id": 3, "author": "Howard Aiken", "quote": "The problem in this business isn't to keep people from stealing your ideas; it's making them steal your ideas!"}, {"id": 4, "author": "Wilfred James Dolor", "quote": "Math is my Passion. Engineering is my Profession."}, {"id": 5, "author": "Unknown", "quote": "Any idiot can build a bridge that stands, but it takes an engineer to build a bridge that barely stands."}, {"id": 6, "author": "Leonardo da Vinci", "quote": "The human foot is a masterpiece of engineering and a work of art."}, {"id": 7, "author": "Christian Cantrell", "quote": "The fewer moving parts, the better. Exactly. No truer words were ever spoken in the context of engineering."}, {"id": 8, "author": "William Gibson ", "quote": "When you want to know how things really work, study them when they're coming apart."}, {"id": 9, "author": "C. Gordon Bell", "quote": "I've never seen a job being done by a five-hundred-person engineering team that couldn't be done better by fifty people."}, {"id": 10, "author": "Douglas Adams", "quote": "A common mistake that people make when trying to design something completely foolproof is to underestimate the ingenuity of complete fools."}, {"id": 11, "author": "Sir Henry Royce", "quote": "Strive for perfection in everything you do. Take the best that exists and make it better. When it does not exist, design it."}, {"id": 12, "author": "Scott Adams", "quote": "Normal people believe that if it ain't broke, don't fix it. Engineers believe that if it ain't broke, it doesn't have enough features yet."}, {"id": 13, "author": "Prakhar Srivastav", "quote": "Engineering is not only study of 45 subjects but it is moral studies of intellectual life."}, {"id": 14, "author": "Simon R. Green", "quote": "First rule of engineering; beware prototypes. Along with, avoid anything made by an engineer who doesn't have all his own fingers."}, {"id": 15, "author": "Steven Johnson", "quote": "The trick to having good ideas is not to sit around in glorious isolation and try to think big thoughts. The trick is to get more parts on the table."}, {"id": 16, "author": "Robert S. Arrighi", "quote": "[John] Kobak explained, 'The way you learn anything is that something fails, and you figure out how not to have it fail again."}, {"id": 17, "author": "James Dyson", "quote": "Manufacturing is more than just putting parts together. It's coming up with ideas, testing principles and perfecting the engineering as well as final assembly."}, {"id": 18, "author": "Hans Y. Tammemagi", "quote": "It is hardly surprising that the malodorous field of garbology has not attained the popularity of rocket science, oil exploration, or brain surgery."}, {"id": 19, "author": "Dr. Mohsin Tiwana", "quote": "Projects we have completed demonstrate what we know - future projects decide what we will learn."}, {"id": 20, "author": "Elon Musk", "quote": "I don't spend my time pontificating about high-concept things; I spend my time solving engineering and manufacturing problems."}, {"id": 21, "author": "Freeman Dyson", "quote": "A good scientist is a person with original ideas. A good engineer is a person who makes a design that works with as few ideas as possible. There are no prima donnas in engineering."}, {"id": 22, "author": "Unknown", "quote": "To the optimist, the glass is half full. To the pessimist, the glass is half empty. To the engineer, the glass is twice as big as it needs to be"}, {"id": 23, "author": "Bill Nye", "quote": "There's nothing I believe in more strongly than getting young people interested in science and engineering, for a better tomorrow, for all humankind."}, {"id": 24, "author": "Hayao Miyazaki", "quote": "But remember this, Japanese boy... airplanes are not tools for war. They are not for making money. Airplanes are beautiful dreams. Engineers turn dreams into reality."}, {"id": 25, "author": "Michio Kaku", "quote": "What we usually consider as impossible are simply engineering problems... there's no law of physics preventing them."}, {"id": 26, "author": "Albert Einstein", "quote": "I was originally supposed to become an engineer but the thought of having to expend my creative energy on things that make practical everyday life even more refined, with a loathsome capital gain as the goal, was unbearable to me."}, {"id": 27, "author": "Donald P. Coduto", "quote": "The most important thing is to keep the most important thing the most important thing."}, {"id": 28, "author": "Neal Stephenson", "quote": "It is exciting to discover electrons and figure out the equations that govern their movement; it is boring to use those principles to design electric can openers. From here on out, it's all can openers."}, {"id": 29, "author": "British Engineer to the Royal Aeronautical Society, 1922.", "quote": "Aeroplanes are not designed by science, but by art in spite of some pretence and humbug to the contrary. I do not mean to suggest that engineering can do without science, on the contrary, it stands on scientific foundations, but there is a big gap between scientific research and the engineering product which has to be bridged by the art of the engineer."}, {"id": 30, "author": "Jean Peronnet", "quote": " A great bridge is a great monument which should serve to make known the splendour and genius of a nation; one should not occupy oneself with efforts to perfect it architecturally, for taste is always susceptible to change, but to conserve always in its form and decoration the character of solidity which is proper."}, {"id": 31, "author": "An Arts graduate's view of engineers", "quote": "An engineer is someone who is good with figures, but doesn't have the personality of an accountant."}, {"id": 32, "author": "John Prebble", "quote": " Architects and engineers are among the most fortunate of men since they build their own monuments with public consent, public approval and often public money."}, {"id": 33, "author": "Dr. AR Dykes", "quote": "Engineering is the art of modelling materials we do not wholly understand, into shapes we cannot precisely analyse so as to withstand forces we cannot properly assess, in such a way that the public has no reason to suspect the extent of our ignorance."}, {"id": 34, "author": "Ove Arup", "quote": "Engineering problems are under-defined, there are many solutions, good, bad and indifferent. The art is to arrive at a good solution. This is a creative activity, involving imagination, intuition and deliberate choice."}, {"id": 35, "author": "G.F.C. Rogers", "quote": "Engineering refers to the practice of organizing the design and construction [and, I would add operation] of any artifice which transforms the physical world around us to meet some recognized need."}, {"id": 36, "author": "Arthur Mellen Wellington", "quote": "Engineering ... to define rudely but not inaptly, is the art of doing that well with one dollar, which any bungler can do with two after a fashion."}, {"id": 37, "author": "John Fowler", "quote": "Engineers ... are not mere technicians and should not approve or lend their name to any project that does not promise to be beneficent to man and the advancement of civilization."}, {"id": 38, "author": "Henry Petroski", "quote": "Engineers ... are not superhuman. They make mistakes in their assumptions, in their calculations, in their conclusions. That they make mistakes is forgivable; that they catch them is imperative. Thus it is the essence of modern engineering not only to be able to check one's own work but also to have one's work checked and to be able to check the work of others."}, {"id": 39, "author": "Anonymous (supposedly found pinned to a site hut during the construction of the Konkan railway)", "quote": "I take the vision which comes from dreams and apply the magic of science and mathematics, adding the heritage of my profession and my knowledge of nature's materials to create a design."}, {"id": 40, "author": "Dalembert", "quote": "Experience serves not only to confirm theory, but differs from it without disturbing it, it leads to new truths which theory only has not been able to reach."}, {"id": 41, "author": "H.S. Drinker", "quote": "From the laying out of a line of a tunnel to its final completion, the work may be either a series of experiments made at the expense of the proprietors of the project, or a series of judicious applications of the results of previous experience."}, {"id": 42, "author": "Sir John Harvey Jones", "quote": "Go for civil engineering, because civil engineering is the branch of engineering which teaches you the most about managing people. Managing people is a skill which is very, very useful and applies almost regardless of what you do."}, {"id": 43, "author": "Thomas Edison", "quote": "I have not failed, but found 1000 ways to not make a light bulb."}, {"id": 44, "author": "Isambard Kingdom Brunel", "quote": "[I am] opposed to the laying down of rules or conditions to be observed in the construction of bridges lest the progress of improvement tomorrow might be embarrassed or shackled by recording or registering as law the prejudices or errors of today."}, {"id": 45, "author": "C.A. Claremont, Spanning Space", "quote": "The history of engineering is really the history of breakages, and of learning from those breakages. I was taught at college 'the engineer learns most on the scrapheap'."}, {"id": 46, "author": "Marcel Pagnol, Critiques des Critiques", "quote": "One has to watch out for engineers - they begin with the sewing machine and end up with the atomic bomb."}, {"id": 47, "author": "Vitruvius", "quote": "Let him not be grasping nor have his mind preoccupied with ... receiving perquisites, but let him with dignity keep up his position by establishing a good reputation. No work can be rightly done without honesty and incorruptibility."}, {"id": 48, "author": "Herbert Hoover", "quote": "No doubt as years go by people forget which engineer did it, even if they ever knew. Or some politician puts his name on it. Or they credit it to some promoter who used other peoples money with which to finance it. But the engineer himself looks back at the unending stream of goodness that flows from his successes with satisfactions that few professions may know. And the verdict of his fellow professionals is all the accolade he wants."}, {"id": 49, "author": "David Billington", "quote": "Engineering or technology is the making of things that did not previously exist, whereas science is the discovering of things that have long existed."}, {"id": 50, "author": "Douglas Adams", "quote": "The major difference between a thing that might go wrong and a thing that cannot possibly go wrong is that when a thing that cannot possibly go wrong goes wrong, it usually turns out to be impossible to get at and repair."}, {"id": 51, "author": "Sir William Halcrow", "quote": "The well being of the world largely depends upon the work of the engineer. There is a great future and unlimited scope for the profession; new works of all kinds are and will be required in every country, and for a young man of imagination and keenness I cannot conceive a more attractive profession. Imagination is necessary as well as scientific knowledge."}, {"id": 52, "author": "Franklin D. Roosevelt", "quote": "There can be little doubt that in many ways the story of bridge building is the story of civilisation. By it we can readily measure an important part of a people's progress."}, {"id": 53, "author": "Yuan-Cheng Fung", "quote": "Engineering is quite different from science. Scientists try to understand nature. Engineers try to make things that do not exist in nature. Engineers stress invention."}, {"id": 54, "author": "Ove Arup", "quote": "When engineers and quantity surveyors discuss aesthetics and architects study what cranes do we are on the right road."}, {"id": 55, "author": "Harry Walter Tyler ", "quote": "The life work of the engineer consists in the systematic application of natural forces and the systematic development of natural resources in the service of man."}, {"id": 56, "author": "Gordon Lindsay Glegg", "quote": "The scientist discovers a new type of material or energy and the engineer discovers a new use for it."}, {"id": 57, "author": "Gustave Eiffel", "quote": "Can one think that because we are engineers, beauty does not preoccupy us or that we do not try to build beautiful, as well as solid and long-lasting, structures? Aren't the genuine functions of strength always in keeping with unwritten conditions of harmony?"}, {"id": 58, "author": "Gordon Lindsay Glegg", "quote": "A scientist can discover a new star but he cannot make one. He would have to ask an engineer to do it for him."}, {"id": 59, "author": "Gordon Stanley Brown", "quote": "Engineering is not merely knowing and being knowledgeable, like a walking encyclopedia; engineering is not merely analysis; engineering is not merely the possession of the capacity to get elegant solutions to non-existent engineering problems; engineering is practicing the art of the organising forces of technological change... Engineers operate at the interface between science and society."}, {"id": 60, "author": "Winston Churchill", "quote": "We shape our buildings, thereafter they shape us."}, {"id": 61, "author": "Thomas Tredgold", "quote": "Engineering is the art of directing the great sources of power in nature for the use and convenience of man."}, {"id": 62, "author": "Theodore Jesse Hoover", "quote": "Engineering is the professional and systematic application of science to the efficient utilisation of natural resources to produce wealth."}, {"id": 63, "author": "Herbert Hoover", "quote": "It is a great profession. There is the satisfaction of watching a figment of the imagination emerge through the aid of science to a plan on paper. Then it moves to realization in stone or metal or energy. Then it brings jobs and homes to men. Then it elevates the standards of living and adds to the comforts of life. That is the engineer's high privilege."}, {"id": 64, "author": "Raul Perez", "quote": "Are engineers better at business than business people? It's debatable. Business people certainly seem to have bigger houses, drive fancier cars, wear nicer clothes and have better looking mates. Engineers lack the time management skills to spend that kind of money. They waste all their time inventing ways to make the most money in the quickest, most efficient way possible. And then when they figure it out, they optimize the process."}, {"id": 65, "author": "Henry Petroski", "quote": "No one wants to learn by mistakes, but we cannot learn enough from successes to go beyond the state of the art."}, {"id": 66, "author": "Isaac Asimov", "quote": "Science can amuse and fascinate us all, but it is engineering that changes the world."}, {"id": 67, "author": "Theodore von Karman", "quote": "Scientists study the world as it is, engineers create the world that never has been."}, {"id": 68, "author": "Lyon Sprague DeCamp", "quote": "The story of civilisation is, in a sense, the story of engineering - that long and arduous struggle to make the forces of nature work for man's good."}, {"id": 69, "author": "Sir James Dyson", "quote": "Manufacturing, science and engineering are...incredibly creative. I'd venture to say more so than creative advertising agencies and things that are known as the creative industries."}, {"id": 70, "author": "Heywood Broun", "quote": "Men build bridges and throw railroads across deserts, and yet they contend successfully that the job of sewing on a button is beyond them."}, {"id": 71, "author": "N.W. Dougherty", "quote": "The ideal engineer is a composite... He is not a scientist, he is not a mathematician, he is not a sociologist or a writer, but he may use the knowledge and techniques of any or all of these disciplines in solving engineering problems."}, {"id": 72, "author": "William A. Smith", "quote": "Engineering is the science of economy, of conserving energy, kinetic and potential, provided and stored up by nature for the use of man. It is the business of engineering to utilise this energy to the best advantage, so that there may be the least possible waste."}, {"id": 73, "author": "Unknown", "quote": "The goal of science and engineering is to build better mousetraps. The goal of nature is to build better mice."}, {"id": 74, "author": "Richard Lamm", "quote": "All we know about the new economic world tells us that nations which train engineers will prevail over those which train lawyers. No nation has ever sued its way to greatness."}, {"id": 75, "author": "James Kip Finch", "quote": "The engineer has been, and is, a maker of history."}, {"id": 76, "author": "Kit Williams", "quote": "You see, my ambition was not to confound the engineering world but simply to create a beautiful piece of art."}, {"id": 77, "author": "Helmut Jahn", "quote": "A good engineer thinks in reverse and asks himself about the stylistic consequences of the components and systems he proposes."}, {"id": 78, "author": "Arthur Mellen Wellington", "quote": "78. Great triumphs of engineering genius--the locomotive, the truss bridge, the steel rail-- ... are rather invention than engineering proper."}, {"id": 79, "author": "Anonymous ", "quote": "An engineer is someone who washes his hands before going to the toilet."}, {"id": 80, "author": "Phillip Johnson-Laird", "quote": "A theory may be so rich in descriptive possibilities that it can be made to fit any data."}, {"id": 81, "author": "William Blake", "quote": "Improvement makes strait roads: but the crooked roads without improvement are roads of genius."}, {"id": 82, "author": "Cecil Balmond", "quote": "Knowing there is a structure, hidden or felt, to the random gives pleasure."}, {"id": 83, "author": "Unknown", "quote": "The engineer's first problem in any design situation is to discover what the problem really is."}, {"id": 84, "author": "Buckminster Fuller", "quote": "You never change things by fighting the existing reality. To change something, build a new model that makes the existing model obsolete."}, {"id": 85, "author": "Peter Rice", "quote": "Gradually people come to you to buy surprise, and the thing that's nicest about it is that when people come to buy surprise, I have no idea of what I'm going to give them either."}, {"id": 86, "author": "Bruce Dickinson", "quote": "Engineering stimulates the mind. Kids get bored easily. They have got to get out and get their hands dirty: make things, dismantle things, fix things. When the schools can offer that, you'll have an engineer for life."}, {"id": 87, "author": "Scott Adams", "quote": "If not for the compulsions of engineers, mankind would never have seen the wheel, settling instead for the trapezoid because some Neanderthal in marketing convinced everybody it had great braking ability."}, {"id": 88, "author": "Pierce Nichols", "quote": "Engineers have more words for screwing up than the Inuit have words for snow."}, {"id": 89, "author": "Igor Sikorsky", "quote": "At that time (1909) the chief engineer was almost always the chief test pilot as well. That had the fortunate result of eliminating poor engineering early in aviation."}, {"id": 90, "author": "John Glenn", "quote": "I guess the question I'm asked the most often is: When you were sitting in that capsule listening to the count-down, how did you feel? Well, the answer to that one is easy. I felt exactly how you would feel if you were getting ready to launch and knew you were sitting on top of two million parts -- all built by the lowest bidder on a government contract."}, {"id": 91, "author": "Unknown", "quote": "We, the unwilling, led by the unknowing, are doing the impossible for the ungrateful. We have done so much, for so long, with so little, we are now qualified to do anything with nothing."}, {"id": 92, "author": "Robert A. Heinlein", "quote": "One man's magic is another man's engineering. Supernatural is a null word."}, {"id": 93, "author": "Sir Horace Lamb", "quote": "93.I am an old man now, and when I die and go to Heaven there are two matters on which I hope for enlightenment. One is quantum electrodynamics and the other is the turbulent motion of fluids. And about the former I am rather more optimistic."}, {"id": 94, "author": "Theodore Roosevelt", "quote": "Whenever you are asked if you can do a job, tell 'em 'Certainly I can!' Then get busy and find out how to do it."}, {"id": 95, "author": "Henry Palmer", "quote": "The engineer is a mediator between the philosopher and the working mechanic and, like an interpreter between two foreigners must understand the language of both, hence the absolute necessity of possessing both practical and theoretical knowledge."}, {"id": 96, "author": "R. Buckminster Fuller", "quote": "When I am working on a problem, I never think about beauty but when I have finished, if the solution is not beautiful, I know it is wrong."}, {"id": 97, "author": "Neil Armstrong", "quote": "I am, and ever will be, a white-socks, pocket-protector, nerdy engineer, born under the second law of thermodynamics, steeped in steam tables, in love with free-body diagrams, transformed by Laplace and propelled by compressible flow."}, {"id": 98, "author": "Excerpt from the Tao Te Ching", "quote": "Thirty spokes share the wheel's hub; it is the center hole that makes it useful. Shape clay into a vessel; it is the space within that makes it useful. Cut doors and windows for a room; it is the holes which make it useful. Therefore benefit comes from what is there; usefulness comes from what is not."}, {"id": 99, "author": "Nikola Tesla", "quote": "The scientific man does not aim at an immediate result. He does not expect that his advanced ideas will be readily taken up. His work is like that of the planter - for the future. His duty is to lay the foundation for those who are to come, and point the way. He lives and labors and hopes."}, {"id": 100, "author": "Edith Clarke", "quote": "There is no demand for women engineers, as such, as there are for women doctors; but there's always a demand for anyone who can do a good piece of work."}, {"id": 101, "author": "Radia Pearlman", "quote": "The world would be a better place if more engineers, like me, hated technology. The stuff I design, if I'm successful, nobody will ever notice. Things will just work, and be self-managing."}]
